/*
 * 주석 예제
 * 
 * 주석은 java 파일이 컴파일 되어 class 파일로 만들어 질때
 * 빠지는 부분이다.
 * 
 * 설명이나 이해한 내용 등을 정리하는 목적으로 사용한다.
 * 작성한 코드의 일부분을 사용하고 싶지 않을 때 사용한다.
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 한줄 짜리 주석...
		// 같은 라인이 통째로 주석 처리 된다.
		/*
		 	이 부분은 여러 줄 주석입니다.
		 	으아으아으아으아
		 	어어어어어어어어
		 */
		// 한줄 주석 처리(Ctrl + /)
//		아아아아아
//		아아아아아
//		아아아아아
//		아아아아아
		
		// 여러줄 주석  처리( ctrl + shift + /)
		/*아아아아아
		아아아아아
		아아아아아
		아아아아아*/
	}
}







